{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Lists feature evidence, impacted files, components, and test IDs for ZIP automation and stable download path features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files and build scripts.",
  "frontend/.gitignore": "Git ignore rules for logs, node_modules, build outputs, export artifacts, and environment files.",
  "frontend/deploy/domain.txt": "Specifies the deployment domain string used for build validation.",
  "frontend/EXPORTING.md": "Docs describing automatic ZIP generation during production builds with prerequisites and quick-start steps.",
  "frontend/index.css": "Global Tailwind-based style definitions with OKLCH variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/scripts/build-with-zip.mjs": "Build script running the production build and automatically generating the ZIP export without prompts.",
  "frontend/scripts/export-zip.mjs": "Creates shank-game.zip from dist/, saves it to export/ and dist/, and logs progress with error handling.",
  "frontend/scripts/validate-deploy-domain.mjs": "Validates deploy/domain.txt for format, permitted characters, and length, exiting with clear errors.",
  "frontend/src/App.tsx": "Root component that renders GamePage.",
  "frontend/src/components/TouchControls.tsx": "Touch control pad component emitting direction changes via arrow buttons.",
  "frontend/src/game/levels.ts": "Defines five level configs with obstacles and helpers for retrieving levels and checking obstacle collisions.",
  "frontend/src/game/Playfield.tsx": "Renders the game grid, obstacles, apple, and shank sprites with pixel-art styling.",
  "frontend/src/game/skins.ts": "Defines skin options for shank and apple sprites and provides localStorage helpers and sprite lookup functions.",
  "frontend/src/game/useShankGame.ts": "Implements the main snake-style game logic, including movement, collisions, levels, scoring, skins, and state management.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor via React Query, refreshing it when the user's identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed for the game.",
  "frontend/src/index.css": "Global styles and Tailwind layers defining arcade-themed colors, fonts, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/GamePage.tsx": "Renders the main game UI, HUD, controls, and integrates the game hook and skin selection.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and utilities for the game's visual theme.",
  "project_state.json": "Maintains the project's versioned state, including feature definitions, issues, and architectural notes for the shank-eats-apples game. Highlights current problems with ZIP export flow and invalid domain names."
}